run/constant/capillaryTransportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      capillaryTransportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

capillaryPressureModel
{
    enabled           true;
    wettingPhase      1;              // 1 = Electrolyte, 2 = Air
    maxPc             1e4;

    // --- Brooks-Corey Model ---
    type              pcBrooksCorey;
    Srw               0.1;   // Residual saturation of the wetting phase
    lambda            1.5;    // Brooks-Corey pore size distribution index
    Pd                9500;  // [Pa] Displacement/Entry Pressure for biggest pore

    // --- VanGenuchten Model ---
    /*
    type              pcVanGenuchten;
    Srw               0.1;   // Residual saturation of the wetting phase
    m                 0.9;    // 0 < m < 1, mostly m > 0.5. also to not that n = 1 / (1-m)
    pc0               14200;  // [Pa] 1/alpha (kind of entry pressure for average pore size!) 

    // --- Leverett J-Function Model ---
    type              pcLeverett;
    theta             70.3;           // [degrees] Contact Angle
    sigma             0.08459;        // [N/m] Surface tension
    phi               0.798;          // Porosity
    D                 1.42e12; // [1/m2] Inverse Absolute Permeability!  @4um = 1.42e11 and @2.65um = 3.23e11

    */
}

relativePermeabilityModel
{
    enabled           true;
    wettingPhase      1;              // 1 = Electrolyte, 2 = Air
    D                 1.42e11; // [1/m2] Inverse Absolute Permeability! @4um = 1.42e11 and @2.65um = 3.23e11

    // --- Brooks-Corey Model ---
    type              krBrooksCorey;
    Srw               0.1;
    lambda            1.5; 

    // --- VanGenuchten Model ---
    /*
    type              krVanGenuchten;
    Srw               0.1;
    m                 0.9;
    */  
}
// ************************************************************************* //
